import matplotlib.pyplot as plt
import numpy as np

# X轴数据
X = []
for i in range(42):
    X.append(i)
print(X)

# Y轴数据
MM_Y = [0, 2.05, -1.5, 0.3, 0.2, -0.7,
        0.5, 0.2, 0.2, 0, -0.25,
        0.1, -0.25, 0.65, 0.4, -0.75,
        0.4, 0.1, 1.6, -0.6, -1.05,
        -0.6, 0.1, -0.6, -0.35, 0.55,
        -0.25, -0.2, 1.2, -0.75, 0.55,
        0.1, -1.1, -0.7, 0.25, -0.7,
        0.6, 0, 0.75, -0.2, 0.2,
        0.4]
FITZ_Y = [-0.06, -0.01, -0.043, 0.038, 0.005, 0.045,
          -0.02, 0.019, -0.018, -0.04, -0.029,
          -0.049, 0.044, -0.015, -0.025, 0.025,
          0.015, -0.028, -0.005, -0.021, 0.044,
          0.058, 0.019, 0.03, -0.016, 0.016,
          -0.02, 0.001, -0.017, -0.025, 0.025,
          0.012, -0.018, -0.034, 0.044, -0.015,
          -0.005, 0.039, -0.003, -0.022, -0.055,
          0.052]
LR_Y = [-0.06, -0.014, -0.05, 0.031, -0.001, 0.041,
        -0.025, 0.013, -0.021, -0.045, -0.033,
        -0.055, 0.04, -0.019, -0.029, 0.019,
        0.01, -0.033, -0.018, -0.025, 0.039,
        0.053, 0.015, 0.024, -0.018, 0.009,
        -0.023, -0.002, -0.019, -0.03, 0.019,
        0.017, -0.022, -0.039, 0.04, -0.019,
        -0.01, 0.034, -0.009, -0.029, -0.058,
        0.046]
KAY_Y = [0.012, 0.015, 0.0125, 0.014, 0.0156, 0.009,
         0.005, -0.001, 0.001, 0.003, 0.002,
         0.003, 0.0015, 0.0017, 0.003, 0.0017,
         0.0017, 0.0018, 0.003, 0.0028, 0.0017,
         0.0017, 0.0015, 0.0005, 0.0012, 0.001,
         0.0005, 0.0005, 0.0003, 0.0001, 0,
         0.0001, -0.0001, 0, -0.0001, 0,
         0.001, -0.001, -0.001, 0.0005, 0, -0.002]

MM_FITZ_Y = [0, 2.2, -1.6, 0.4, 0.3, -0.8,
             0.6, 0.3, 0.25, 0.1, -0.33,
             0.25, -0.33, 0.72, 0.55, -0.8,
             0.45, 0.2, 1.78, -0.9, -1.1,
             -0.73, 0.25, -0.79, -0.5, -1.1,
             -0.3, -0.35, 1.25, -0.89, 0.7,
             0.3, -0.45,-1.28, -0.76, 0.8,
             0.81, 0, 0.77, -0.42, 0.5,
             0.6]

fig, ax = plt.subplots()
ax.plot(X, MM_Y, label='M&M')
ax.plot(X, FITZ_Y, label='Fitz')
ax.plot(X, LR_Y, label='L&R')
ax.plot(X, KAY_Y, label='Kay')
ax.plot(X, MM_FITZ_Y, label='M&M+L&R')

# 标记点
for i in range(42):
    plt.scatter(X[i], MM_Y[i], color='blue', marker='s')
for i in range(42):
    plt.scatter(X[i], FITZ_Y[i], color='orange', marker='o')
for i in range(42):
    plt.scatter(X[i], LR_Y[i], color='green', marker='*')
for i in range(42):
    plt.scatter(X[i], KAY_Y[i], color='red', marker='p')
for i in range(42):
    plt.scatter(X[i], MM_FITZ_Y[i], color='purple', marker='h')
# for i in range(9):
#     plt.scatter(X[i], MM_FITZ_Y[i], color='brown', marker='H')

# 设置刻度值
plt.xticks([0, 5, 10, 15, 20, 25, 30, 35, 40, 45],
           ['0', '5', '10', '15', '20', '25', '30', '35', '40', '45'])
plt.yticks([-1.5, -1, -0.5, 0, 0.5, 1, 1.5, 2, 2.5],
           ['-1.5', '-1', '-0.5', '0', '0.5', '1', '1.5', '2', '2.5'])

# 设置图表标题、坐标轴标签等
ax.set_title("Estimation Range Of Different Frequency Offset Algorithms")
ax.set_xlabel("Sequence Length")
ax.set_ylabel("Frequency Offset Estimation Value")

# 显示图例
plt.legend()
plt.grid(True)
# 保存图表到文件
plt.savefig('img/Estimation_Range_Lab3.png')
plt.show()
